       IDENTIFICATION          DIVISION.
       PROGRAM-ID. 01-OLACOBOL.
       PROCEDURE               DIVISION.
           DISPLAY "OLÁ, COBOL!".
           STOP RUN.