       IDENTIFICATION          DIVISION.
       PROGRAM-ID. OLACOBOL.
       PROCEDURE               DIVISION.
           DISPLAY "OLÁ, COBOL!".
           STOP RUN.