       IDENTIFICATION          DIVISION.
       PROGRAM-ID. 01-CLIENTES.
      * COMENTARIO 
       ENVIRONMENT             DIVISION.
       DATA                    DIVISION.
       PROCEDURE               DIVISION.
           DISPLAY "CLIENTES".
           STOP RUN.